#+title:      B Klasse 2022-26
#+date:       [2022-12-30 Fr 19:34]
#+filetags:   :2b:Project:
#+identifier: 20221230T193456
#+CATEGORY: golling
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+TODO: TODO(t) STARTED(s!) WAITING(w@/!) APPT(a) PROJ(p) NOTIZ(n) NEXT(x) BESPROCHEN(b) DELEGATED(g@/!) | DONE(d!) CANCELED(c@)
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width \linewidth
#+OPTIONS: toc:nil
#+export_file_name: ~/RoamNotes/exports/2b.html
#+AUTHOR: Matthias Fuchs
#+EMAIL: matthiasfuchs01@gmail.com

* 2B [KV Martin Pock]

#+Name: 2021-students
| First     | Last       | Name               | Note | Mitarbeit | Heft | LZK |
|-----------+------------+--------------------+------+-----------+------+-----|
| *Lorenz   | Aschauer   | [[Lorenz Aschauer][Lorenz Aschauer]]    |    2 |           |      |     |
| Emma      | Gonschorek | [[Emma Gonschorek][Emma Gonschorek]]    |    1 |           |      |     |
| Marie     | Hofer      | [[Marie Hofer][Marie Hofer]]        |    1 |           |      |     |
| Nena      | Langenfeld | [[Nena Langenfeld][Nena Langenfeld]]    |    1 |           |      |     |
| *Bernhard | Neureiter  | [[Bernhard Neureiter][Bernhard Neureiter]] |    2 |           |      |     |
| Manuel    | Reiter     | [[Manuel Reiter][Manuel Reiter]]      |    1 |           |      |     |
| Emma      | Riebler    | [[Emma Riebler][Emma Riebler]]       |    1 |           |      |     |
| Annika    | Seiwald    | [[Annika Seiwald][Annika Seiwald]]     |    1 |           |      |     |
| *Valerian | Seling     | [[Valerian Seling][Valerian Seling]]    |    2 |           |      |     |
| Theresa   | Steiner    | [[Theresa Steiner][Theresa Steiner]]    |    1 |           |      |     |
| Valentina | Struber    | [[Valentina Struber][Valentina Struber]]  |    1 |           |      |     |
| Felix     | Wenger     | [[Felix Wenger][Felix Wenger]]       |    1 |           |      |     |
| Leon      | Zemmer     | [[Leon Zemmer][Leon Zemmer]]        |    1 |           |      |     |
| Fabian    | Zorzi      | [[Fabian Zorzi][Fabian Zorzi]]       |    1 |           |      |     |
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(2021-22-Mitarbeit,@@#$2)) 

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':END: ')
      print('\n')
      print('|-----------------------+-----------+-------------------------+---------------|')
      print('| Datum / UE            | Stunde    | Thema                   | Anmerkungen   |')
      print('|-----------------------+-----------+-------------------------+---------------|')
      print('\n')
      print('*** Note ' + first + ' ' + last)
      print('|-----------+-------------+-----+-----------+------------|')
      print('| Mitarbeit | Heft / Buch | LZK | Sonstiges | Gesamtnote |')
      print('|-----------+-------------+-----+-----------+------------|')
      print('|         2 |           3 |   2 |         3 |        2.5 |')
      print('#+TBLFM: $5=vmean($1..$4)')
      print('\n')
#+END_SRC

#+RESULTS:
